In [17]:
import pandas as pd
df = pd.DataFrame([[25,'남',185,89],
                   [19,'여',163,53],
                   [27,'남',177,63]],
                   index=['이겨레','조약돌','강산애'],
                   columns=['나이','성별','키','체중']
                  )
#df.set_index('성명')
df

     나이 성별    키  체중
이겨레  25  남  185  89
조약돌  19  여  163  53
강산애  27  남  177  63

In [18]:
df.transpose()

    이겨레  조약돌  강산애
나이   25   19   27
성별    남    여    남
키   185  163  177
체중   89   53   63

In [19]:
df.T

    이겨레  조약돌  강산애
나이   25   19   27
성별    남    여    남
키   185  163  177
체중   89   53   63

### 복사해서 드랍하기

In [34]:
df1 = df.copy()
df1.drop('조약돌', axis=0, inplace=True)
df1

     나이 성별    키  체중
이겨레  25  남  185  89
강산애  27  남  177  63

In [35]:
df

     나이 성별    키  체중
이겨레  25  남  185  89
조약돌  19  여  163  53
강산애  27  남  177  63

In [36]:
df2 = df.copy()
df2.drop(['조약돌','이겨레'],inplace=True)
df2

     나이 성별    키  체중
강산애  27  남  177  63

In [39]:
df3 = df.copy()
df3.drop(['나이'],axis=1,inplace=True)
df3

    성별    키  체중
이겨레  남  185  89
조약돌  여  163  53
강산애  남  177  63

In [40]:
bio_data = {
    '성명': ['이겨레', '조약돌'],
    '나이': [25, 19],
    '성별': ['남', '여'],
    '키': [185, 163],
    '체중': [89, 53]
}
df = pd.DataFrame(bio_data)
df.set_index('성명',inplace=True)
df

     나이 성별    키  체중
성명
이겨레  25  남  185  89
조약돌  19  여  163  53

### 다양한 파일로 저장하기

In [41]:
df.to_excel('df_patient.xlsx')

In [42]:
df.to_csv('df_patient.csv')

In [43]:
df.to_json('df_patient.json')

### 하나의 엑셀파일에 여러개 시트 만들기

In [44]:
bio_data = {'성명':['이겨레','조약돌'],
           '나이':[25,19],'성별':['남','여'],
           '키':[185,163],'체중':[89,53]}
pulse_data = {'환자코드':['A00301','D00809'],
             '수축기':[123,118],'이완기':[89,79]}

In [45]:
df1 = pd.DataFrame(bio_data)
df1.set_index('성명',inplace=True)
df1

     나이 성별    키  체중
성명
이겨레  25  남  185  89
조약돌  19  여  163  53

In [46]:
df2 = pd.DataFrame(pulse_data)
df2.set_index('환자코드',inplace=True)
df2

        수축기  이완기
환자코드
A00301  123   89
D00809  118   79

In [48]:
d_save = pd.ExcelWriter('df_blood.xlsx')
df1.to_excel(d_save,sheet_name='생체 데이터') # 첫 번째 엑셀 시트에 저장
df2.to_excel(d_save,sheet_name='혈압 데이터') # 두 번째 엑셀 시트에 저장
d_save.save()

### 미니 프로젝트 1

In [56]:
df = pd.DataFrame([['서울',785,693,885,697],
                   ['런던',543,608,724,815]],
                  columns=['도시명','1/4분기','2/4분기','3/4분기','4/4분기']
                 )
df

  도시명  1/4분기  2/4분기  3/4분기  4/4분기
0  서울    785    693    885    697
1  런던    543    608    724    815

In [51]:
df.to_excel('df_cp0901.xlsx')

In [52]:
df.to_csv('df_cp0901.csv')

In [53]:
df.to_json('df_cp0901.json')

### 파일 읽기

In [57]:
data = 'health_data.xlsx'
df1_01 = pd.read_excel(data)
df1_02 = pd.read_excel(data,header=None)
df1_01

    코드번호 성별    키  체중    BMI  수축기  이완기
0  33001  남  175  65  21.22  143  110
1  34037  여  165  52  19.10  119   78
2  35123  여  159  67  26.50  130   83

In [58]:
df1_02

       0   1    2   3      4    5    6
0   코드번호  성별    키  체중    BMI  수축기  이완기
1  33001   남  175  65  21.22  143  110
2  34037   여  165  52   19.1  119   78
3  35123   여  159  67   26.5  130   83

In [61]:
data = 'health_data_01.csv'
df1_01 = pd.read_csv(data, encoding='cp949')
df1_01

    코드번호 성별    키  체중    BMI  수축기  이완기
0  33001  남  175  65  21.22  143  110
1  34037  여  165  52  19.10  119   78
2  35123  여  159  67  26.50  130   83

In [63]:
data = 'health_data_02.csv'
df1_02 = pd.read_csv(data)
df1_02

    코드번호 성별    키  체중    BMI  수축기  이완기
0  33001  남  175  65  21.22  143  110
1  34037  여  165  52  19.10  119   78
2  35123  여  159  67  26.50  130   83

In [64]:
data = 'df_patient.json'
df = pd.read_json(data,encoding='cp949')
df

     나이 성별    키  체중
이겨레  25  남  185  89
조약돌  19  여  163  53

In [104]:
df = pd.DataFrame([['이겨레',25,'남',185,89],
                   ['조약돌',19,'여',163,53]],
                   columns=['성명','나이','성별','키','체중']
                  )
df.set_index('성명')

     나이 성별    키  체중
성명
이겨레  25  남  185  89
조약돌  19  여  163  53

In [111]:
df = pd.DataFrame([['이겨레',25,'남',185,89],
                   ['조약돌',19,'여',163,53]],
                   index=['처','음'],
                   columns=['성명','나이','성별','키','체중']
                  )
df

    성명  나이 성별    키  체중
처  이겨레  25  남  185  89
음  조약돌  19  여  163  53

In [112]:
df.reset_index()

  index   성명  나이 성별    키  체중
0     처  이겨레  25  남  185  89
1     음  조약돌  19  여  163  53

In [113]:
df.sort_index(ascending=False)

    성명  나이 성별    키  체중
처  이겨레  25  남  185  89
음  조약돌  19  여  163  53

In [114]:
df = pd.read_csv('./data/member.csv')
df.shape # 행, 렬

(10, 9)

In [115]:
df

       코드   이름 성별  연령 혈액형    키  체중    BMI       운동시작일
0  330531  이겨레  남  26   A  181  76  23.20  2021-01-01
1  340037  조약돌  여  25   B  185  89  26.00  2020-12-25
2  194563  강산애  남  27   A  177  63  20.11         NaN
3  503546  원미연  여  48   O  166  55  19.96  2021-03-05
4  330543  오대양  남  31  AB  193  95  25.50         NaN
5  341257  송가인  여  45   O  157  48  19.47         NaN
6  472358  성공찬  여  53   B  159  50  19.78  1997-10-24
7  185823  황산성  남  52   B  178  87  27.46         NaN
8  232305  신영웅  남  19  AB  163  53  19.95  2021-05-08
9  489602  최고봉  남  64   A  168  57  20.20  1988-08-15

In [116]:
df.head(2)

       코드   이름 성별  연령 혈액형    키  체중   BMI       운동시작일
0  330531  이겨레  남  26   A  181  76  23.2  2021-01-01
1  340037  조약돌  여  25   B  185  89  26.0  2020-12-25

In [117]:
df.tail()

       코드   이름 성별  연령 혈액형    키  체중    BMI       운동시작일
5  341257  송가인  여  45   O  157  48  19.47         NaN
6  472358  성공찬  여  53   B  159  50  19.78  1997-10-24
7  185823  황산성  남  52   B  178  87  27.46         NaN
8  232305  신영웅  남  19  AB  163  53  19.95  2021-05-08
9  489602  최고봉  남  64   A  168  57  20.20  1988-08-15

In [118]:
df.이름.dtypes

dtype('O')

In [119]:
df.연령.dtypes

dtype('int64')

In [120]:
df.BMI.dtypes

dtype('float64')

In [121]:
df.describe() # 산술 데이터에 대해서만 기술 통계 정보 출력
# count : 열데이터의 개수
# mean : 평균값
# std : 표준 편차
# 25% : 최소와 중간의 사잇값

                  코드         연령           키         체중        BMI
count      10.000000  10.000000   10.000000  10.000000  10.000000
mean   342056.500000  39.000000  172.700000  67.300000  22.163000
std    117049.733168  15.202339   11.898179  17.807926   3.086555
min    185823.000000  19.000000  157.000000  48.000000  19.470000
25%    256861.500000  26.250000  163.750000  53.500000  19.952500
50%    335290.000000  38.000000  172.500000  60.000000  20.155000
75%    439582.750000  51.000000  180.250000  84.250000  24.925000
max    503546.000000  64.000000  193.000000  95.000000  27.460000

In [122]:
df.describe(include='all') # 산술 데이터가 아닌 열 포함 기술 통계 정보 출력

,코드,이름,성별,연령,혈액형,키,체중,BMI,운동시작일
count,10.000000,10,10,10.000000,10,10.000000,10.000000,10.000000,6
unique,NaN,10,2,NaN,4,NaN,NaN,NaN,6
top,NaN,신영웅,남,NaN,B,NaN,NaN,NaN,2021-05-08
freq,NaN,1,6,NaN,3,NaN,NaN,NaN,1
mean,342056.500000,NaN,NaN,39.000000,NaN,172.700000,67.300000,22.163000,NaN
std,117049.733168,NaN,NaN,15.202339,NaN,11.898179,17.807926,3.086555,NaN
min,185823.000000,NaN,NaN,19.000000,NaN,157.000000,48.000000,19.470000,NaN
25%,256861.500000,NaN,NaN,26.250000,NaN,163.750000,53.500000,19.952500,NaN
50%,335290.000000,NaN,NaN,38.000000,NaN,172.500000,60.000000,20.155000,NaN
75%,439582.750000,NaN,NaN,51.000000,NaN,180.250000,84.250000,24.925000,NaN
max,503546.000000,NaN,NaN,64.000000,NaN,193.000000,95.000000,27.460000,NaN

In [123]:
df.count()

코드       10
이름       10
성별       10
연령       10
혈액형      10
키        10
체중       10
BMI      10
운동시작일     6
dtype: int64

In [124]:
df['코드'].value_counts() # NAN 열을 포함한 개수 계산

232305    1
489602    1
330531    1
194563    1
340037    1
472358    1
341257    1
503546    1
185823    1
330543    1
Name: 코드, dtype: int64

In [125]:
df['코드'].value_counts(dropna=True) # NAN 열은 제외한 개수 계산

232305    1
489602    1
330531    1
194563    1
340037    1
472358    1
341257    1
503546    1
185823    1
330543    1
Name: 코드, dtype: int64

In [130]:
df['BMI'].value_counts()

23.20    1
19.47    1
19.95    1
27.46    1
26.00    1
20.11    1
25.50    1
20.20    1
19.96    1
19.78    1
Name: BMI, dtype: int64

### 미니 프로젝트2

In [133]:
target = pd.read_csv('./data/member.csv')
df = pd.DataFrame(target)
df

       코드   이름 성별  연령 혈액형    키  체중    BMI       운동시작일
0  330531  이겨레  남  26   A  181  76  23.20  2021-01-01
1  340037  조약돌  여  25   B  185  89  26.00  2020-12-25
2  194563  강산애  남  27   A  177  63  20.11         NaN
3  503546  원미연  여  48   O  166  55  19.96  2021-03-05
4  330543  오대양  남  31  AB  193  95  25.50         NaN
5  341257  송가인  여  45   O  157  48  19.47         NaN
6  472358  성공찬  여  53   B  159  50  19.78  1997-10-24
7  185823  황산성  남  52   B  178  87  27.46         NaN
8  232305  신영웅  남  19  AB  163  53  19.95  2021-05-08
9  489602  최고봉  남  64   A  168  57  20.20  1988-08-15

In [142]:
a = df.value_counts('BMI')
a

BMI
19.47    1
19.78    1
19.95    1
19.96    1
20.11    1
20.20    1
23.20    1
25.50    1
26.00    1
27.46    1
dtype: int64

In [145]:
df.BMI.dtype

dtype('float64')

In [146]:
a.dtype

dtype('int64')

### 값 산출

In [149]:
df.mean() # 평균값

코드     342056.500
연령         39.000
키         172.700
체중         67.300
BMI        22.163
dtype: float64

In [150]:
df['BMI'].mean()

22.163

In [151]:
df[['키','체중']].mean()

키     172.7
체중     67.3
dtype: float64

In [152]:
# 중간값 산출하기
df['BMI'].median()

20.155

In [153]:
df[['키','체중']].median()

키     172.5
체중     60.0
dtype: float64

In [154]:
df.median()

코드     335290.000
연령         38.000
키         172.500
체중         60.000
BMI        20.155
dtype: float64

### 미니 프로젝트3

In [156]:
height = df['키'].mean()
height

172.7

In [157]:
weight = df['체중'].median()
weight

60.0

In [158]:
df.max()

코드     503546
이름        황산성
성별          여
연령         64
혈액형         O
키         193
체중         95
BMI     27.46
dtype: object

In [159]:
df['연령'].max()

64

In [160]:
df[['키','체중']].max()

키     193
체중     95
dtype: int64

In [161]:
df.std() # 표쥰편차

코드     117049.733168
연령         15.202339
키          11.898179
체중         17.807926
BMI         3.086555
dtype: float64

In [163]:
df[['키','BMI']].std()

키      11.898179
BMI     3.086555
dtype: float64

In [164]:
df.corr() # 상관 계수

           코드        연령         키        체중       BMI
코드   1.000000  0.572318 -0.343057 -0.377510 -0.397892
연령   0.572318  1.000000 -0.426925 -0.316438 -0.176555
키   -0.343057 -0.426925  1.000000  0.942296  0.796228
체중  -0.377510 -0.316438  0.942296  1.000000  0.950220
BMI -0.397892 -0.176555  0.796228  0.950220  1.000000

In [167]:
df[['키','체중']].corr()

           키        체중
키   1.000000  0.942296
체중  0.942296  1.000000

### 미니 프로젝트3

In [168]:
df['BMI'].std()

3.0865552535688283

In [169]:
df[['연령','체중']].corr()

          연령        체중
연령  1.000000 -0.316438
체중 -0.316438  1.000000